Re10_testCase_including_Meshing/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-15 -15 -48)
    ( 15 -15 -48)
    ( 15  15 -48)
    (-15  15 -48)
    (-15 -15  12)
    ( 15 -15  12)
    ( 15  15  12)
    (-15  15  12)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 75 150) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (4 5 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (0 3 2 1)
        );
    }
    farField
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
	    (0 4 7 3)
	    (1 2 6 5)
        );
    }
);

// ************************************************************************* //
