Re10_testCase_including_Meshing/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default 		backward;
}

gradSchemes
{
    default         	Gauss linear;
}

divSchemes
{
    default         			none;
    div(phi,U)      			Gauss limitedLinearV 1.0;
    div(phi,K)      			Gauss limitedLinear 1.0; 
    div(phi,h)      			Gauss limitedLinear 1.0;
    div(phi,k)      			Gauss limitedLinear 1.0; 
    div(phi,epsilon) 			Gauss limitedLinear 1.0; 
    div(phi,R)      			Gauss limitedLinear 1.0; 
    div(R)          			Gauss linear;
    div((muEff*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
    default         			none;
    laplacian(muEff,U) 			Gauss linear corrected;
    laplacian(Dp,p_rgh) 		Gauss linear corrected;
    laplacian(alphaEff,h) 		Gauss linear corrected;
    laplacian(alphaEff,e) 		Gauss linear corrected;
    laplacian(DkEff,k) 			Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) 	Gauss linear corrected;
    laplacian(DREff,R) 			Gauss linear corrected;
    laplacian(rhorAUf,p_rgh) 		Gauss linear corrected;
}

interpolationSchemes
{
    default         	linear;
}

snGradSchemes
{
    default         	corrected;
}

fluxRequired
{
    default         	no;
    p_rgh;
}

// ************************************************************************* //
