Re10_testCase_including_Meshing/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    p_rgh
    {
        solver           	GAMG;
        tolerance        	1e-7;
        relTol           	0;
        smoother         	GaussSeidel;

        cacheAgglomeration 	true;
        nCellsInCoarsestLevel 	10;
        agglomerator     	faceAreaPair;
        mergeLevels      	1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-10;
        relTol           0;
    }

    "(U|e|k|epsilon|R)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|e|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-10;
        relTol           0;
    }

    h
    {
        $U;
    }

    hFinal
    {
        $h;
        tolerance        1e-10;
        relTol           0;
    }

}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors     2;
    nCorrectors          2;
    nNonOrthogonalCorrectors 2;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "h.*"          0.5;
        "U.*"          0.4;
    }
}

// ************************************************************************* //
