Re10_testCase_including_Meshing/system/functionObjects/minMaxSolid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 
    temperatureMinMaxSolid
    {
	type        fieldMinMax;
	functionObjectLibs ("libfieldFunctionObjects.so");
	write       yes;
	log         yes;
	location    yes;
	mode        magnitude;
	region	    solidSphere;
	
	fields
	(
	    T
	);
    }

// ************************************************************************* //
