Re10_testCase_including_Meshing/system/functionObjects/monitorsFluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 
    averageFluidTemperature
    {
	type            	cellSource;
	functionObjectLibs 	("libfieldFunctionObjects.so");
	enabled         	true;
	log             	true;
	valueOutput     	false;
	outputControl   	timeStep;
	outputInterval  	10;
	region			fluid;
	source          	cellZone;
	sourceName      	fluid;
	operation       	volAverage;
	
	fields
	(
	    T
	);
    }
    
    outletFlowWeightedFluidTemperature
    {
	 type            	faceSource;
	 functionObjectLibs 	("libfieldFunctionObjects.so");
	 log             	true;
	 valueOutput     	false;
	 outputControl   	timeStep;
	 outputInterval  	10;
	 source          	patch;
	 sourceName      	outlet;
	 region 		fluid;
         operation       	weightedAverage; 	
	 weightField     	phi; 	
	 
	 fields
	 (
	      T
	 );
    }
    
    averageSurfaceTemperatureFluid
    {
    
        type                  	faceSource;
        functionObjectLibs 	("libfieldFunctionObjects.so");
        outputControl   	timeStep;
        outputInterval   	10;
        log                   	yes;
        valueOutput           	false;
        source              	patch; 			
        sourceName         	fluid_to_solidSphere; 
        region 			fluid;
        operation         	areaAverage;
	
        fields
        (
            T
        );
    }

// ************************************************************************* //
