Re10_testCase_including_Meshing/system/functionObjects/probesFluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    probesFluid
    {
        functionObjectLibs 	( "libsampling.so" );
        type            	probes;
        name            	probes;
        outputControl   	timeStep;
	outputInterval  	10;
	region			fluid;
	
        fields
        (
            T
        );
	
        probeLocations
        (
            ( 0.001 0.001  0.6 )    
            ( 0.001 0.001 -0.6 )
	    ( 0.001 0.001 -1.0 )  
        );
    }

// ************************************************************************* //
