Re10_testCase_including_Meshing/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    fluidSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 -100 ) (100 100 100);
        }
    }
    {
        name    fluidSet;
        type    cellSet;
        action  delete;
        source  zoneToCell;
        sourceInfo
        {
            name solidSphere;
        }
    }
    {
        name    fluid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set fluidSet;           
        }
    }
    {
        name    fluid;
        type    cellSet;
        action  remove;
    }
    {
        name    solidSphereSet;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name solidSphere;
        }
    }
);

// ************************************************************************* //
